#+title: Emacs init file
#+STARTUP: hidestars
#+STARTUP: overview
#+roam_alias: "emasc init file"
this init file install package with =user-package= and =straight=.
Some package is in the github.

- tags :: dotfile, [[file:../linux.org][Linux]]

*** [[file:../ecj_sql.org][ejc sql]]
    ~ejc sql~ 是一个使用 ~clojure/java.jdbc~ 库来链接数据库的简单的 ~emacs sql client~

    #+begin_src elisp
      (use-package ejc-sql
        :ensure t
        :config
        (require 'ejc-company)
        (push 'ejc-company-backend company-backends)

        :init
        (setq ejc-temp-editor-file-path "/tmp"))
    #+end_src

    #+begin_src elisp
      (ejc-create-connection
       "test-db"
       :dependencies [[com.oracle.database.jdbc/ojdbc8 "19.7.0.0"]]
       :dbtype "oracle"
       :dbname "xe"
       :port "1521"
       :host "localhost"
       :user "system"
       :password "oracle"
       :separator "/")
    #+end_src

    #+RESULTS:
    | test-db | (:separator . /) | (:dependencies . [[com.oracle.jdbc/ojdbc6 11.0.0.0]]) | (:password . hr) | (:user . hr) | (:port . 1521) | (:host . localhost) | (:dbname . xe) | (:dbtype . oracle) |

